"""
Константы для хеш-таблицы
"""

# русский алфавит с номерами для рассчета V, h(V)
RUS_ALPHABET = {
    'А': 0, 'Б': 1, 'В': 2, 'Г': 3, 'Д': 4, 'Е': 5, 'Ё': 6, 'Ж': 7, 'З': 8,
    'И': 9, 'Й': 10, 'К': 11, 'Л': 12, 'М': 13, 'Н': 14, 'О': 15, 'П': 16,
    'Р': 17, 'С': 18, 'Т': 19, 'У': 20, 'Ф': 21, 'Х': 22, 'Ц': 23, 'Ч': 24,
    'Ш': 25, 'Щ': 26, 'Ъ': 27, 'Ы': 28, 'Ь': 29, 'Э': 30, 'Ю': 31, 'Я': 32
}


TABLE_SIZE = 20

# начальный адрес таблицы 
BASE_ADDR = 0

LINEAR_PROBE_STEP = 3

ID_MAX_LEN = 64
DATA_MAX_LEN = 128